In [1]:
import pandas as pd

In [11]:
#Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.
pd.Series([4,8,15,16,23,42])

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [12]:
#Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.
df_Series = [1,2,3,44,22,12,23,14,6,9]
pd.Series(df_Series)

0     1
1     2
2     3
3    44
4    22
5    12
6    23
7    14
8     6
9     9
dtype: int64

In [20]:
#Q3. Create a Pandas DataFrame that contains the following data:
df = pd.DataFrame({'Name':['Alice','Bob','Claire'],'Age':[25,30,27],'Gender':['Female','Male','Female']})
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [ ]:
#Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Ans4.A dataframe is of more than one dimension that means it has many rows and columns. Whereas a series has just one column and      is of single dimension.

In [ ]:
#Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
#    you give an example of when you might use one of these functions?

Ans5.1.pd.isna()-to check whether a given column or columns has null values
     2.df.head(n)-gives first n rows in a dataframe
     3.df.tail(n)-gives last n rows in a dataframe
     4.df.value_counts()-returns unique values in a dataframe
     5.pd.read_csv()-reads a file of type csv

In [23]:
3+2

5

In [ ]:
#Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Ans6.Series-immutable
    DataFrame-mutable
    Panel-mutable

In [31]:
#Q7. Create a DataFrame using multiple Series. Explain with an example.
Name = pd.Series(['Ramesh','Suresh','Rajesh'])
Age = pd.Series([30,25,23])
Salary = pd.Series([60000,50000,50000])
df = pd.concat([Name,Age,Salary],axis = 1)
df

        0   1      2
0  Ramesh  30  60000
1  Suresh  25  50000
2  Rajesh  23  50000